In [1]:
import pandas as pd

In [2]:
pd.Series([1, 2, 3])#Erzeugt eine Pandas Series

0    1
1    2
2    3
dtype: int64

In [6]:
df = pd.DataFrame({'A': [0, 1, 2], 'B': [5, 3,4], 'C': [3,5,6]})#Erzeugt ein Pandas DataFrame

In [8]:

df.head(2)#Zeigt die ersten n Zeilen

   A  B  C
0  0  5  3
1  1  3  5

In [9]:
df.tail(2)#Zeigt die letzten n Zeilen

   A  B  C
1  1  3  5
2  2  4  6

In [11]:
#Statistiken für numerische Spalten
df.describe()#Mittelwert, Std., min, max etc. je Spalte

         A    B         C
count  3.0  3.0  3.000000
mean   1.0  4.0  4.666667
std    1.0  1.0  1.527525
min    0.0  3.0  3.000000
25%    0.5  3.5  4.000000
50%    1.0  4.0  5.000000
75%    1.5  4.5  5.500000
max    2.0  5.0  6.000000

In [13]:
#Zeigt die Größe des DataFrames
df.shape #Tuple (Zeilen, Spalten)

(3, 3)

In [15]:
df.columns #Index mit den Spaltennamen

Index(['A', 'B', 'C'], dtype='object')

In [16]:
#Gibt Zeilenindex zurück
df.index

RangeIndex(start=0, stop=3, step=1)

In [17]:
df.dtypes #Listet Datentypen der Spalten auf

A    int64
B    int64
C    int64
dtype: object

In [24]:
df = pd.DataFrame({'A': [0, 1, 2], 'B': [5, 3,4], 'C': [3,5,6]})
print(df)
#Auswahl per Label
df.loc[0, 'A'] #Wert der ersten Zeile in Spalte A
df.loc[2, 'A'] #Wert der dritte Zeile in Spalte A
df.loc[1, 'C'] # 5 Wert zweite Zeile in Spalte C

   A  B  C
0  0  5  3
1  1  3  5
2  2  4  6

np.int64(5)

In [26]:
#Auswahl per Position
df.iloc[0, 1]# Wert an Position [0,1]

np.int64(5)

In [30]:
#Entfernt Zeilen oder Spalten
df.drop('A', axis=1)#DataFrame ohne Spalte A

   B  C
0  5  3
1  3  5
2  4  6

In [32]:
df.drop(0, axis=0) #DataFrame ohne Zeile mit Index 0

   A  B  C
1  1  3  5
2  2  4  6

In [44]:
df = pd.DataFrame({'A': [0, None , 3], 'B': [5, 0, 4], 'C': [None,5,6]})#Findet null Werte(wo nichts steht)
df.isnull()#DataFrame mit True für null Werte(genau für None)

       A      B      C
0  False  False   True
1   True  False  False
2  False  False  False

In [45]:
df.notnull()

       A     B      C
0   True  True  False
1  False  True   True
2   True  True   True

In [46]:
df.fillna(0) #Ersetzt null Werte: DataFrame mit 0 anstelle null Werte

     A  B    C
0  0.0  5  0.0
1  0.0  0  5.0
2  3.0  4  6.0

In [47]:
df.dropna() #Entfernt Zeilen mit null Werten (NONE)

     A  B    C
2  3.0  4  6.0

In [51]:
#Wendet Funktion auf Spalte/Zeile an
import numpy as np
df = pd.DataFrame({'A': [0, 1, 2], 'B': [5, 3,4], 'C': [3,5,6]})
df['A'].apply(np.sqrt)#Berechnet Quadratwurzel für Spalte A

0    0.000000
1    1.000000
2    1.414214
Name: A, dtype: float64

In [56]:
df = pd.DataFrame({'A': [1, 1, 2], 'B': [5, 9,4], 'C': [3,1,6]}) # für gleiche Werte bei A (1 und 1), werden Werte von B und C summiert
# B : 5+9= 14
# C : 3+1 = 4
df.groupby('A').sum() #Summiert Werte je Gruppe in A

    B  C
A
1  14  4
2   4  6

In [63]:
df1 = pd.DataFrame({'A': [1, 1], 'B': [2,2]})
df2 = pd.DataFrame({'A': [1, 3], 'B': [3, 3]})
df1.merge(df2, on='A')

   A  B_x  B_y
0  1    2    3
1  1    2    3

In [75]:
df = pd.DataFrame({'A': [3, 1, 2], 'B': [5, 9,4], 'C': [3,1,6]})
df.sort_values(by='A')#Sortiert DataFrame nach Werten

   A  B  C
1  1  9  1
2  2  4  6
0  3  5  3

In [76]:
df.pivot_table(values='C', index='A')#Pivot-Tabelle mit Spalte C und Index A)

     C
A
1  1.0
2  6.0
3  3.0

Eine Pivot-Tabelle in Pandas (und in Datenanalyse allgemein) ist eine Technik, um Daten zu zusammenzufassen und in einer übersichtlichen, strukturierten Form darzustellen. Sie ist besonders hilfreich, um große Datenmengen zu analysieren und verschiedene Metriken (wie Summe, Mittelwert, Anzahl) über bestimmte Kategorien hinweg zu berechnen.

Wie eine Pivot-Tabelle funktioniert
Eine Pivot-Tabelle funktioniert, indem sie:

Eine oder mehrere Spalten als Zeilen und Spalten des neuen, zusammengefassten DataFrames auswählt.
Eine oder mehrere Spalten aggregiert (z. B. Summe, Mittelwert), um zusammengefasste Informationen für jede Kombination von Zeilen- und Spaltenwerten zu berechnen.

In [78]:
import pandas as pd

data = {
    'Region': ['Nord', 'Süd', 'Nord', 'Ost', 'Süd', 'Ost', 'West'],
    'Produkt': ['A', 'A', 'B', 'A', 'B', 'B', 'A'],
    'Umsatz': [200, 120, 340, 250, 150, 300, 400]
}
df = pd.DataFrame(data)
pivot_df = df.pivot_table(values='Umsatz', index='Region', columns='Produkt', aggfunc='sum')
print(pivot_df)

Produkt      A      B
Region
Nord     200.0  340.0
Ost      250.0  300.0
Süd      120.0  150.0
West     400.0    NaN

In [85]:
df = pd.DataFrame({'A': [3, 1, 2], 'B': [5, 9,4], 'C': [3,1,6]})
df['A'].astype(float)
#df['A'].astype(str)
#df['A'].astype(bool)

0    3.0
1    1.0
2    2.0
Name: A, dtype: float64

In [96]:
df = pd.DataFrame({'A': [1, 1, 2], 'B': [1, 1, 4], 'C': [1, 1, 6]}) #Findet doppelte Zeilen
df.duplicated()

0    False
1     True
2    False
dtype: bool

In [97]:
df['A'].unique() #Gibt einzigartige Werte in einer Spalte

array([1, 2])

In [103]:
df = pd.DataFrame({'A': [1, 1, 4, 4,4], 'B': [1, 1, 4, 4, 3], 'C': [1, 1, 6, 4, 4]})
df['A'].value_counts() #Zählt die Häufigkeit von Werten in einer Spalte
df['B'].value_counts() #Zählt die Häufigkeit von Werten in einer Spalte
df['C'].value_counts() #Zählt die Häufigkeit von Werten in einer Spalte

C
1    2
4    2
6    1
Name: count, dtype: int64

In [105]:
df.rename(columns={'A': 'E'})#Benennt Spalten um

   E  B  C
0  1  1  1
1  1  1  1
2  4  4  6
3  4  4  4
4  4  3  4

In [107]:
df.query('A > 2')#Filtert DataFrame mit einer Abfrage
#DataFrame mit Zeilen, wo A > 2

   A  B  C
2  4  4  6
3  4  4  4
4  4  3  4

In [109]:
#Setzt eine Spalte als Index
df.set_index('A') #DataFrame mit A als Index-Spalte

   B  C
A
1  1  1
1  1  1
4  4  6
4  4  4
4  3  4